# Ultralytics YOLO26-MoE (with UltimateOptimizedMoE)
# Parameters
nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]] # 1
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, UltimateOptimizedMoE, [256, 4, 2, 0.5]] # 3 (新增)
  - [-1, 1, Conv, [256, 3, 2]] # 4 (原3)
  - [-1, 2, C3k2, [512, False, 0.25]] # 5 (原4)
  - [-1, 1, UltimateOptimizedMoE, [512, 4, 2, 0.5]] # 6 (新增)
  - [-1, 1, Conv, [512, 3, 2]] # 7 (原5)
  - [-1, 2, C3k2, [512, True]] # 8 (原6)
  - [-1, 1, UltimateOptimizedMoE, [512, 8, 2, 0.5]] # 9 (新增)
  - [-1, 1, Conv, [1024, 3, 2]] # 10 (原7)
  - [-1, 2, C3k2, [1024, True]] # 11 (原8)
  - [-1, 1, UltimateOptimizedMoE, [1024, 8, 2, 0.5]] # 12 (新增)
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 13 (原9)
  - [-1, 2, C2PSA, [1024]] # 14 (原10)

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]] # 引用原6，现索引8（C3k2,512）
  - [-1, 2, C3k2, [512, True]] # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # 引用原4，现索引5（C3k2,512? 注意原4是C3k2,512，现索引5是C3k2,512）
  - [-1, 2, C3k2, [256, True]] # 20 (P3/8)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]] # 引用第17层（C3k2,512）
  - [-1, 2, C3k2, [512, True]] # 23 (P4/16)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # 引用第14层（C2PSA,1024）
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 26 (P5/32)

  - [[20, 23, 26], 1, Detect, [nc]] # 更新检测层索引
