#'''
#输入 x
#    │
#    ├─ 共享专家（始终激活）
#    │
#    ├─ ExplicitDescriptor（0 参数确定性描述子）
#    │   └─ s = α·var_norm + β·energy_norm
#    │
#    ├─ 层级预算注入（前验）
#    │   └─ s' = s × cascade_weight
#    │
#    ├─ 直接映射（闭式解）
#    │   └─ top_k = 1 + round(clamp(s', 0, 1) × (K_max - 1))
#    │
#    ├─ 路由器（仅决定"哪个专家"）
#    │
#    └─ 融合门控 → output
#'''


nc: 20
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]   # depth, width, max_channels
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, SparseDualMoE, [512, 4, 4, 0.2, 0.01, 5000, 1e-3, 0.001, 8, 1.0, 0.5, 0.5]]       # 6 (P4, cascade_weight=1.0, alpha=0.5, beta=0.5)
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 2, SparseDualMoE, [1024, 4, 4, 0.2, 0.01, 5000, 1e-3, 0.001, 8, 1.0, 0.5, 0.5]]      # 8 (P5, cascade_weight=1.0, alpha=0.5, beta=0.5)
  - [-1, 1, SPPF, [1024, 5, 3, True]]   # 9
  - [-1, 2, C2PSA, [1024]]              # 10

# YOLOv26n head (unchanged)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]            # cat backbone P4
  - [-1, 2, C3k2, [512, True]]           # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]            # cat backbone P3
  - [-1, 2, C3k2, [256, True]]           # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]           # cat head P4
  - [-1, 2, C3k2, [512, True]]           # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]           # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]      # Detect(P3, P4, P5)